{"24428": ["With a movie like this you wonder how all of the otherwise, main characters will work together and support the story.\r\n\r\nNo problems here.  While as might be expected, R. Downey Jr. comes across largely central, it is still a good mix and IMHO the best scenes in the movie involve the generated Hulk character.\r\n\r\nWith that kind of successful melding of characters, Hollywood-scale egos and even computer generated characters; you have to give it up to the writers and director to make this the successful film that it is.", "**A long format review from 2012**\r\n\r\nMy new favourite Marvel Cinematic Universe film, undoubtedly! Order goes thusly;\r\n\r\n1. The Avengers\r\n2. Iron Man\r\n3. Thor\r\n4. Captain America\r\n5. Iron Man 2\r\n6. The Incredible Hulk\r\n\r\nI had the privilege of going to Sydney and watching this almost a full three weeks before it’s American release, in a special advance screening for fans and a handful of critics. I drove up and back on a day trip with my mate HRV, spent over $400 between us… So worth it.\r\n\r\nI think perhaps my expectations of The Avengers were too high. In fact I know they were, even so, I feel that it almost managed to meet them. All but two of the fears I had about this epic were quashed without a doubt. I initially was worried about Mark Ruffalo helming the role of The Hulk/Bruce Banner after taking over from Edward Norton who was ousted after his first appearance. My complaints were completely unfounded however, as Mark Ruffalo presents us with an at least as good Marvel Hero. \r\n\r\nIn terms of entertainment, The Avengers is one of the greatest feats ever produced. At the screening I went to, I actually missed more than a couple of lines due to the fact that the entire bloody cinema was in hysterics from some classic Joss Whedon (Director - Buffy, Angel, Firefly, Dollhouse) humour. The squabbles between these larger than life characters are not quite up to the peak that Jon Favreau’s Iron Man & Iron Man 2 sit on, but in terms of film in general, they are some of the better interactions I’ve ever seen.\r\n\r\nThe only weak points I really have to whinge about are both quite minor, and perhaps can be rectified in the MCU future. Firstly, Thor’s return to Earth (whilst brilliantly dramatic and pretty) was quite weak in terms of exposition. That said, this isn’t a Thor movie, so we don’t need to know everything that happens to him. Also, in next year’s Thor 2, it is very possible we’ll discover more specific details about the first few scenes of his return. Secondly, Loki’s army also came across to me quite weakly. In case we have any Marvel aficionados in the crowd, I won’t spoil it by telling you who they’re supposed to be, but in general the whole army was essentially a meat shield used to bump out scenes in which The Avengers get to kick ass. A very enjoyable part of the film, but one that doesn’t really drive the story at all.\r\n\r\nI feel the only way I can adequately describe just how much you need to see this movie (in cinemas) is this: For those of you who understand me, you will be know and be aware of just how much I fucking hate the concept of Blu-Ray. I am going to buy a Blu-Ray player, a HD television, and Blu-Ray discs, just so that I will get more special features when The Avengers is released. Never have I even considered doing such a thing before.\r\n\r\nThe Avengers doesn’t get into your mind and rape it in the best way possible like Revolver or Donnie Darko. It doesn’t get into your guts and turn them with nostalgic violence like the brilliance in Doomsday or Outpost. It gets into your heart, and leaves you not just wanting, but needing more. Long live the MCU!\r\n\r\n90%\r\n\r\n-Gimly", "After the recent disappointments from Marvel, notably Thor and the abysmal second instalment of Ghost Rider, this was a pleasant experience.\r\n\r\nThe special effects are dazzling, the plot is acceptable and the heroes are not making total idiots out of themselves just because the director wanted some “depth” to their characters. Sure there is a little bickering in between them but not too much to distract from the fun.\r\n\r\nI’ve always liked Robert Downey Jr’s portrayal of Tony Stark and his sharp tongue. I did wonder how they where going to get the Hulk in there since he’s supposed to be uncontrollable but they did it. Okay they downplayed his uncontrollability a bit but I can live with that. I absolutely loved the “puny god” scene (if you haven’t seen the film yet you’ll have to see it to know what I mean, I wont spoil it in advance).\r\n\r\nI have to say that I found Thor himself a bit underwhelming again though. I just expect something more imposing as the good of thunder. But then I’m Scandinavian so…\r\n\r\nAnyway, this was a great film. I enjoyed it very much.", "One of the few movies to actually make me feel like a kid again, Joss Whedon was the perfect filmmaker to do this film. Everyone gets their time to shine. The script juggles every plot point and character moment with clarity and ease. It's funny, smart, and visually jaw dropping. Definitely lived up to the five movie hype.", "I give this 10 Stars based on it being not only better than the trailer and the hype made me thing it would be, but also that it was the first time anything the size and scope of the Marvel Cinematic universe was pulled off successfully. Having Joss direct this movie lives and dies on character interaction. This movie is on the definitive list in my opinion even just for that.", "Everything that's happening, the things that are about to come to light, people might just need a little old fashioned.\r\n\r\nThe Avengers (AKA: Avengers Assemble) is written and directed by Joss Whedon, with Zak Penn co-writing the story. It stars Robert Downey Junior, Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Tom Hiddlestone, Clark Gregg, Samuel L. Jackson, Cobie Smulders and Stellan Skarsgard. Music is scored by Alan Silvestri and cinematography by Seamus McGarvey.\r\n\r\nAsgardian outcast Loki (Hiddlestone) has struck a deal with the Chitauri to exchange the Tesseract for an army with which he can attack Earth and thus control it. With the Earth in mortal danger, S.H.I.E.L.D director Nick Fury (Jackson) activates the Avengers Initiative; a collection of super heroes and deadly assassins who, if they can actually come together as one united force, hold the fate of the Earth in their hands.\r\n\r\nI have no real frame of reference with The Avengers comic book world, when I was young I read a bit of Spidey, Batman and was kind of partial to The Fantastic Four, but I really don't remember story lines and gave up reading that sort of stuff once sport and exams came into my life. I love movies and as I enter the later stages of my forties I'm pleased to say I have a wide range of film genre interests. I have very much enjoyed The Avengers solo films so far, with the exception of Iron Man 2 which quite frankly is average at best, but the reality is that if The Avengers failed as a movie, that Whedon got it so wrong, then I wouldn't be foaming at the mouth or proclaiming that the director be stripped naked and whipped around the streets of Hollywood! As it is, with one or two minor irks aside, The Avengers is about as much fun as I have had with a movie in quite a few years.\r\n\r\nI wouldn't know if the makers got the essence right, or if the story is at one in the Marvel Avengers Universe, I just know that it is a right old blast and made a colossal amount of money at the box office, even trumping The Dark Knight Rises in that department. It's a film full of derring-do heroics, ripe witticisms, wonderfully staged action, simmering sexual tensions, ego collisions, charm, heart and splendid human interactions. It looks fabulous on Blu-ray, the art design, the colour photography and Silvestri's score rumbles like thunder and crackles like lightning, just as a super hero movie score should do. The cast performances are hugely enjoyable as they bounce off of one and other, feeding off the respective thespian energy with a knowing of the right tone to make this colourful comic book world be all that it can be. While Whedon, with a weight of expectation akin to Atlas holding the World on his shoulders, comes through with flying colours with astute pacing and an impressive marshaling of an acting army.\r\n\r\nFlaws? Jackson's Nick Fury could have done with more screen time and Cobie Smulders is sadly short changed as well. The Chitauri are only really a threat because of their sheer numbers, not because of any great alien design, and, well, The Hulk CGI hasn't really advanced much from the 2008 version, but really these are small itches rather than big ones. Is The Avengers the best film of 2012? It will be seen as such for many fans of the source(s) who have waited with baited breath for this coming together of their heroes, and that notion really shouldn't irk the more highbrow film fans out there. Me? No it isn't the best film of 2012, but as I found my self perched on the edge of my seat as the finale unfurls in a wave of explosive heroic energy, and I caressed my ribs from laughing out loud, I knew then that undoubtedly The Avengers is the most fun film of 2012. 9/10", "The Avengers is a dream movie come true for superhero fans with its group of extremely talented actors and epic champions, to create an action- packed movie with hilarious banter laced in between scenes. I love how each of the actors and actresses has portrayed each of the roles they were given.", "Definitely the greatest superhero movie of all time. Marvel has set the bar high with this one and so far, they're doing a good job of keeping up with that despite not being able to raise it higher!", "I found it creative of Marvel to introduce each character one by one. It really set the tone and had me looking forward to what's gonna happen.", "Perfect casting! You can really see and feel that the actors have great chemistry both in and out of their characters.", "Wonderful movie to watch if you want to be entertained and not think about the plot too much.", "When you have a bunch of flashy superheroes fighting supernatural, extraterrestrial villains from another dimension, it can get pretty hard to highlight each of their strengths,  but Marvel pulled it off with this one!", "The Avengers is a dream movie come true for superhero fans with its group of extremely talented actors and epic champions, to create an action- packed movie with hilarious banter laced in between scenes. I love how each of the actors and actresses has portrayed each of the roles they were given.", "I tried my best to avoid getting carried away by the hype of this movie because nowadays most of the movies that are too much hyped end up just being disappointments but I'm glad to say that I WAS NOT DISAPPOINTED when this came out.", "One word for this movie: AWESOME. It’s an amazing film and has everything a superhero fanboy hoped for and more.", "One of the many things I loved in this film was the conflict between Iron Man and Captain America for leadership and how the two differ in their approach. A very unique way of building a team of superheroes.", "The cast really delivered. Sure they were playing the roles of superheroes but you can really see and feel a deeper level of emotions in their performance.", "Kudos to the fight choreographers who designed all the action sequences for this movie. They really did a good one!", "If you haven't seen this film yet, do yourself a favor and remain unspoiled. This is one of the movies that need to be savored.", "Good fighting sequences but camerawork feels too crazy and made it quite difficult to fully enjoy the great choreography."], "99861": ["There is a lot going on in this movie but it all just seemed kind of pointless and dull to me. Every now and then there would be a good scene or piece of dialogue but for the most part I felt myself getting bored and reaching for my phone to play Cribbage. I guess what I didn't like most is that it all felt like a big filler episode instead of an action packed character driven story arc.", "Action, good Fx and a \"not-completely-absurd\" story. The actors perform well and you can identify them very well with their characters ... but it is all old and without imagination.\r\n\r\nI suppose nobody was expecting anything else, though ...", "This is another one of those movies that you watch primarily for the special effects with you favourite super heroes slugging it out. It is a classical Hollywood product where the story is mostly there just as a vehicle for allowing the special effects team to do their business. As such it is a success.\r\n\r\nThe movie starts of with a display of action and the afore mentioned special effects with an attack by the Avengers on a bad guy stronghold. Not surprisingly the events sows the seeds for things to come.\r\n\r\nThe movie starts off with quite an interesting story idea with the activation of Ultron. However, once he materializes as a physical entity, it became a bit of seen that, been there and done that. Ultron just turns into yet another “standard” comic book villain a’ la Megatron running around trying to look intimidating while implementing his diabolical scheme. Okay, there was a bit of originality here and there but with the good start I kind of expected a wee bit more.\r\n\r\nHaving said that, the movie does indeed fulfil its purpose of showing off a bunch of super heroes slugging it out in a flurry of special effects and, although the story idea was perhaps not used as intelligently as I had hoped, it is not bad (for this kind of movie of course) and hangs together pretty okay. Sure, it is somewhat contrived and the means by which Ultron tries to exterminate humanity is overly complicated but it is still a decent story.\r\n\r\nOverall the movie was entertaining and provided the necessary special effects and super hero fix for those who are inclined to enjoy those kind of movies. I certainly am and, not surprisingly, the kids liked it as well.", "**A long form review originally posted in 2015:**\r\n\r\nI’ve just returned from two back-to-back viewings of _Avengers: Age of Ultron_, and I do not regret one bit going in for that second helping.\r\n\r\nI lost my steam on the _Age of Ultron_ wagon at a very inopportune moment. About three days before it came out. I was so heavily anticipating it for such a long time, that I was actually much more excited to see this movie when it was still two months away than I was waiting in line to get into the cinema it was playing at. The combination of the market-saturation and the fact that the _Ultron _hype-train has been running for literally years, with a first trailer dropping seven months before the damn thing came out, meant I got weary of the thing just a fraction too soon. But I’m a sucker for the MCU, and there was no way I was missing the sequel to my favourite superhero movie of all time.\r\n\r\nI won’t harp on too much, because I don’t want to spoil anything (especially given that the movie isn’t even out in most parts of the world), I will put out a spoilertalk on this blog at some point down the line, but for now just let me leave you with a couple of quick thoughts.\r\n\r\n_Age of Ultron_ is not the best film of all time. It’s not the best superhero film of all time, it’s not even the best MCU film. Honestly, I personally feel it’s not even the best MCU Phase 2 film. But it is still good. And that’s what’s important here. But what do I mean by that? \r\n\r\nWell, for starters, in and of itself, I loved it, a breach past an 80% approval rating from me is no small thing. The things we enjoyed from the first _Avengers_are here. The mesmerising action spectacles of course, but I more mean the character moments we got between the Avengers themselves, that was my favourite part of the first film and we get it here again in spades. \r\n\r\nEvery new thing Joss has added to the plate works splendidly as well, real Hawkeye story, new heroes, a new villain, an updated world, all of these things are big ticks in lots of boxes.\r\n\r\nSo if everything from _The Avengers_ works and everything they’ve added works great too, why is _Age of Ultron_ not a perfect film? For spoiler-free purposes I will not go into detail, but that’s okay because the answer is quite simple: Everything in _Age of Ultron_ is great. It’s what’s not in _Age of Ultron_ that’s the problem.\r\n\r\nJoss Whedon said that the film had to be cut by nearly an hour. That way you get more showings in, and that means more money. Now I’m not saying we need every minute of that hour back, but what we ended up being left with, was just enough for _Age of Ultron_ to be the _Thor: The Dark World_ of the _Avengers _franchise (it was a far superior film to _Dark World_, but hear me out). _Age of Ultron_ is little more than a holding pattern. The set-ups for future films take up too much time for the story to bear the weight of some actual story, but everything that occurs in the film itself somehow also has virtually no consequence on world it is a part of. I can’t say it more plainly than that: It’s a holding pattern. It introduces some stuff, but it doesn’t stand alone the first film did. It’s not such a big deal when the solo-movies do that (like the aforementioned _Dark World_) because we have _The Avengers_ films for those to pay off in. But when an _Avengers_ entry is just more of the same, I can’t fully get behind it.\r\n\r\nThat all said, _Age of Ultron_ is of course a lot of fun. A huge amount of fun, I can’t state that enough. And there’s literally nothing more important something in the entertainment industry can be. These are just the things holding it back from taking it up to the next level (or if I’m being completely honest, even taking it to the level the first film was at).\r\n\r\n75%\r\n\r\n-_Gimly_", "The fact that Joss Whedon was able to salvage some sort of coherent film out of all he was forced to cram into a single movie is quite commendable. But the sad fact is that Avengers: Age of Ultron is really just a run of the mill \"bad guy wants to destroy the world for reasons\" actioner that we've seen done better many times before.\r\n\r\nDon't get me wrong. The movie's fun. The dialogue is frequently clever and humourous. And I really appreciated the quiet bits of storytelling that Whedon was able to sneak in. It's just that at the end of the day, the villain is weak sauce, there's way too much set up for other movies, and if I'm criticizing Man of Steel for having excessive destruction, I can't give Avengers a pass since they needlessly blow up not one, not two, but three cities. Pretty sure many insurance agencies went bankrupt paying out all the victims.", "Movie was great but felt like there was just too much action and fighting. The creativity of the choreography gets lost in the whirlwind of action and this I noticed most in Captain America's scenes. He does like a hundred different awesome things with his shield, but you don't have time to really take it in because you're already looking at Iron Man blasting 20 Ultron-bots to bits.", "This is the movie where Captain America became my favorite Avenger. Sure he doesn't have monstrous abilities like Iron Man and Hulk, but to be holding his own on the same ground as them is just a testament to how great of a hero he truly is.", "It has become a well-known fact that coming out with a sequel that's better than, if not on par with, the first one is an insane task. But kudos to Marvel for staying true to their colors with this sequel.", "I expected more from Quicksilver.  He would've been a great addition to the Avengers.", "The thing that puzzles me is that in this film, Vision is presented to be a powerful hero, having the mind stone and all. But on the next films, he's become more of like a side character that just wasn't relevant anymore except for that little piece of stone on his forehead. Shame.", "I'm glad to see that they found another role for Hawkeye other than being that one guy who seemed to be trying hard to keep up with the other more powerful heroes on the team. Now he's more of like the thing that keeps the team together and it suits his character well.", "Movie was great but felt like there was just too much action and fighting. The creativity of the choreography gets lost in the whirlwind of action and this I noticed most in Captain America's scenes. He does like a hundred different awesome things with his shield, but you don't have time to really take it in because you're already looking at Iron Man blasting 20 Ultron-bots to bits.", "Avengers: Age of Ultron\r\nI liked plenty of the stuff in it but it was pretty much the same as the first movie. Still a good watch though if you're not looking for anything serious.", "The humor in this movie was not as witty as the first one. It felt too childish and cheesy.", "Still good, clean Avengers fun though a bit messier. The first one was still better.", "With the vast array of heroes and their own personal character stories, you can expect how much of a challenge it is to bring together all these superheroes and have them work on a single mission on a single timeline. It's not easy, experts.", "I confirmed in this movie that what's really making these films successful is the chemistry that the actors have. You can really see that everyone's doing their best.", "Strong film from beginning to end. Has just enough humor, angst, and drama to make it a film worthy to be called a sequel.", "If you're a fan of action, suspense, and awe worthy moments, then this movie is the right fit for you! Overall outstanding performance by everyone both on and off screen.", "Despite the challenge of having to top their first Avengers film, Marvel did beautifully and the result was amazing. I hope to see more films like this in the future."], "271110": ["Well another super-sized Marvel Comics superhero saga hits the big screen with the selected savior Captain America taking the top billing on the marquee. Thus, the pulsating popcorn pleaser **Captain America: Civil War** arrives on the scene to giddy audiences that have been loyal and fixated on the successful spring of mighty Marvel heroes that have been paraded to viewers throughout the last few years. Thankfully, **Captain America: Civil War** carries on the tradition of spry superhero-studded spectacles that have been glorious and adventurous from the stable of Marvel-based movies guaranteed to win over the enthusiastic hearts of avid comic book fanboys everywhere. Joyously overstuffed and convincingly extensive with a super team armed with crime-fighting excess, **Civil War** seizes the moment to introduce a noteworthy twist: two factions of rescuing superpowers engaging in some explosive in-house fighting led by two of Marvel Comics main standouts in Chris Evans’s Captain America and Robert Downey Jr.’s Iron Man.\r\n\r\nCo-directors Anthony Russo and Rene Russo were instinctively crafty to link the overly successful Iron Man film franchise to the **Captain America: Civil War** inner circle to ensure an even more treasured toxic atmosphere. Superhero fans will get a thrill of witnessing the extra add-ons concerning other dynamic titans to join the action-packed festivities involving Team Captain America versus Team Iron Man. True, **Civil War** has its share of flaws but that does not take away from this heroes-in-crisis flick demonstrating its ambitious overtones.\r\n\r\nSo what has caused the bad blood among the great and grand good guys known for protecting the world from evil dominance and destruction? Essentially the theme of collateral damage, the involvement regarding civilian-related deaths and injuries plus the world-wide backlash has created a controversy pitted against The Avengers. Specifically, Captain America (a.k.a. Steve Rogers) and Scarlet Witch/Wanda Maximoff (Elizabeth Olsen)  are responsible for the boisterous battle that caused such negative sensation resulting in political turmoil. Avengers head honcho Iron Man (a.k.a. Tony Stark) is dealing with his own personal regrets in the ill-advised creation of the unpredictable Ultron. The political authority want to hold Iron Man, second-in-command Captain America and the rest of the Avengers accountable for the global devastation that have taking its toll when trying to oversee the potential harm wreaking havoc on humanity.\r\n\r\nLeading the charge in putting a watchful eye on the labeled reckless Avengers is Secretary of State Thaddeus Ross (William Hurt) that suggests the super group be monitored by the United Nations. Naturally friction develops between the superheroes that either agree with Ross’s UN restriction policies or disagree with being placed under a microscope that threatens to handcuff their free-wheeling heroic duties. All these contrasting beliefs eventually turn into epic back-and-forth confrontations where the raging Avengers are at odds with each other.\r\n\r\nFor Stark/Iron Man’s stance, he is willing to toe the line and ultimately agree that his crew needs to tone down their tenacious tactics as crime-stoppers. Iron Man’s consciousness, particularly in the case of a disillusioned mother (Alfre Woodward) making him feel guilt-ridden over her son’s death during an intense Battle of Sokovia, is probably the main factor behind his decision to have his team reigned in a bit from the political watchdogs. Siding with Iron Man’s viewpoint are the likes of Black Widow (Scarlett Johansson), Vision (Paul Bettany) and War Machine (Don Cheadle). As for Rogers/Captain America, he is not too thrilled being put in check by the intrusive governmental pencil-pushers that want to scrutinize the team’s every move. Standing with Captain America firmly are Falcon (Anthony Mackie) and the aforementioned Scarlet Witch.\r\n\r\nOn top of Captain America’s current Avengers-oriented strife in his contentious mingling with Iron Man and his ardent backers, he now finds himself trying to defend his old buddy-turned-wanted man Winter Soldier (Sebastian Stan) who is accused of killing civilians. Iron Man believes in Winter Soldier’s innocence and goes so far as to help him escape. Yes…Winter Soldier does come with more baggage attached to him–mainly in the form of the menacing Zemo (Daniel Bruhl).\r\n\r\nThe Russos and screenwriters Christopher Marckus and Stephen McFeely (all attached to the previous “Captain America: Winter Soldier”) provide the eyeful visual effects that predictably stimulate and effectively add to the overload of frenzied frolicking in this boisterous blockbuster. Certainly the deepened angst among this bombastic bunch works far more solidly than what was displayed in the stiffened and problematic Batman v. Superman. The notion that the entire globe and its leaders are weary of all the collective chaos at the hands of the Avengers trying to save their hides is a bit ridiculous. Besides, why are not the foes of the Avengers put on the hot coals for the societal ruination? It seems rather counterproductive to chastise the noble superpowers offering the safety of mankind yet the detractors not being grateful for the services that the Avengers bring to the table. It is somewhat convoluted to think that the global community are sour on our heralded heroes or that the heat generated within the walls will completely destroy the Avengers and their colorful, capable colleagues.\r\n\r\nThe movie’s aptly entitled **Civil War** does invite more punch to the proceedings especially when a who’s who of superhero showstoppers join the feisty fray at hand. The noted inclusion of defiant do-gooders are packed with the likes of Spider-Man (Tom Holland), the retired returnee Hawkeye (Jeremy Renner), Ant-Man (Paul Rudd), and nifty newcomer Black Panther (Chadwick Boseman). No doubt Captain America: Civil War is the impish and energizing launch pad for upcoming Marvel-induced movies waiting to make their future distinctive arrival on the big screen. Although Evans’s steady and charismatic Captain America more than holds his own as the solo act billed in the film’s title one cannot overlook Downey’s compelling Iron Man as the reliable source that lifts the profile of Evans’s Masked Wonder. This is indeed a collaborative big score for the glorified costumed cast but special kudos are reserved for Stan’s killing culprit as well as Boseman’s African president assuming the slick and resourceful Black Panther.\r\n\r\nYeah, **Captain America: Civil War** is true to its frenetic form as revved up entertainment preparing moviegoers for the upcoming summertime sizzle at the box office. After all, the on-screen Marvel Comics gravy train keeps moving merrily along so stay tuned.\r\n\r\n**Captain America: Civil War (2016)**\r\n\r\nWalt Disney Pictures\r\n\r\n2 hrs 26 mins.\r\n\r\nStarring: Chris Evans, Robert Downey, Jr., Scarlett Johansson, Sebastian Stan, Anthony Mackie, Don Cheadle, Jeremy Renner, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Paul Rudd, Daniel Bruhl, Alfre Woodward, William Hurt\r\n\r\nDirected by: Anthony Russo and Joe Russo\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Superheroes Saga/Action and Adventure/Science Fiction/Fantasy\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)\r\n\r\n**(c) Frank Ochieng**", "The Russo Brother's and Marvel did it again! Read my full review here!\r\n\r\nhttp://www.hweird1reviews.com/allreviews/captain-america-civil-war-review", "**The heroes're divided and so the fans!**\r\n\r\nBefore watching this I thought what the Avengers are doing here. I believed they got the title wrong. Once I watched it, I'm still the same. Because it did not look like the Captain America's film, he never was dominated, so calling it as his film totally inappropriate. Technically, it is a third Avengers film and well done. I liked it, it was entertaining. But the Civil War means it's nothing a nation's war within, just these super-guys fight for themselves against what kind of administration they want to come under.\r\n\r\nI think they have heard that people's complaint about blowing up the buildings during reviewing other films by bringing up this one. So they finger pointed those events in this narration and that is one of the reasons for the Civil War to take place. Particularly disturbing the public and loss of many lives when these powerful men fighting the bad guys. The fun part is they are off the street and had a most important confrontation of the film in a deserted airfield. So does it make people who were whining about that be happy?\r\n\r\nI don't know, but as an entertaining film, it did everything it can give the best for the viewers. Like the title and posters reveal, the heroes are divided here and probably you're going to take a side. Like usual, I'm with the Stark. So if you're like me, then you would feel the annoyance with the opposite team, particularly like Antman and obviously Captain America's rebellious decision. It was like the world versus United States, because only Americans are behind Captain America. Anyway, I did not like dividing the fans and what this film has been a serious damage. I hope the fans won't take it seriously.\r\n\r\n_8/10_", "Recently I have quite liked the Marvel movies that I have watched. Sadly I did not like this movie at all. The only reason that it does not get a zero or one star rating is cool special effects and a few laughs.\r\n\r\nI want my heroes to be just that, heroes. Unfortunately this movie gets off on the wrong foot right away by not only “incriminating” the Avengers in the eyes of dimwit politicians and putting them on surveillance of a political body but to make matters worse it is the useless black hole of taxpayers money, the United Nations, that are supposed to surveil them. That pretty much ruined the movie right away for me.\r\n\r\nWhen I though that it could not get any worse it actually does. In true Hollywood fashion the Avengers start to bicker and fight among themselves.\r\n\r\nThe few redeeming qualities of this movie is great special effects and a few fun comments that made me laugh from time to time. Even the ending is pretty crappy with the Avengers remaining divided and the main bad guy feeling that he achieved what he wanted.\r\n\r\nTechnically there is not really anything wrong with the movie. The actors are good, the filming is good and, as I wrote, the special effects are great. The story however is not my cup of tea to put it mildly. I cannot express how much I despised the story in this movie.", "Good movie, love Captain American.", "<b>A long form review originally posted in 2016</b>\r\n\r\nIt’s commonplace for me to need more than one viewing to really nail down my feelings on a movie, that’s particularly true of MCU, and even more so of this particular film. That all said, here is my initial reaction to _Captain America: Civil War_.\r\n\r\nAs is often the case, it’s hard to write down too comprehensive a post about a film this early on while remaining totally spoiler-free, so for starters, I’ll just go ahead and ask the thing that was on my mind from about five minutes in to _Civil War_: I want to know how it is that two guys who have a filmography so firmly rooted in sitcoms of all things, manage to direct action this spectacularly? Honestly. It’s insane.\r\n\r\n_Winter Soldier_ is one of the strongest MCU films in my opinion, and just like that felt mostly like a follow up to both the prior _Captain America_ film and the prior _Avengers_ film, _Civil War_ feels the same, but for the sequels to said films (_Winter Soldier_ and _Age of Ultron_). That said, it might lean a little too far on to the side of _Avengers_-sequel, and a little too light on the _Cap_-sequel. If you had to pick a lead here, it would be Steve Rogers, no mistake, but this does feel like a film painted with a very broad brush of characterisation to be solely a “_Captain America_” movie.\r\n\r\nConsidering the sheer scope of the piece, it’s amazing that the Russo brothers managed to get the ball rolling on _Civil War_ as well as they did. Even so, there are a couple of roles I felt could have been cut altogether without really impacting the story, and that time could perhaps have been used to serve some underrepresented puzzle pieces. Perhaps both the inclusion in places and lack of inclusion in others is because of plans for future MCU films (though certainly not all instances can use that excuse) but either way, if I’m hunting for flaws, that to some degree is one.\r\n\r\nI will say, that for all of _Civil War’s_ ups and downs (mostly ups), it is both a worthy entrant into Marvel’s franchise, and perhaps even more importantly, it actually even addresses some of the problems left in _Age of Ultron_. Of course the acting is all above board, the primary action set-piece is just dumbfoundingly fun, and the evolution of the mythology meshes with the universe at large.\r\n\r\n_Civil War_ may not be my favourite superhero movie, or even my favourite MCU movie (I mean it also might be, I think I need to give it at least another two watches to be sure) but it might just be the best comic book adaptation movie. By that, I don’t mean it accurately portrayed the events of the Marvel “Civil War” event from back 2006, because that’s not even close to true. What I mean is, there are so many instances that manage capture the spirit of what the comics are. And you almost feel like you are watching one unfold before you on the screen. A glorious, squillion dollar, two and a half hour comic book.\r\n\r\nOh yeah. And the new superheroes introduced in _Civil War_? They’ve got me pretty bloody excited.\r\n\r\n79%\r\n\r\n-_Gimly_", "The Captain America movies have managed to ground the MCU by exploring the political and social climate created by the Avengers' existence. Actions have consequences and consequences influence more action.\r\n\r\nCivil War isn't as focused as The Winter Soldier. It's also overstuffed with characters and fan service. However, the movie works by always being intriguing. Both sides of the conflict are portrayed as equally valid. The exploration of superhero accountability isn't anything new (explored in Watchmen and The Dark Knight), but it's nice to see it incorporated into a grand cinematic universe. Also, Captain Zemo is a better than average villain because while underdeveloped, his motive is interesting and not just \"destroy the world.\"\r\n\r\nAlso, SPIDER-MAN IS FINALLY IN THE MCU!!!! 😁😁😁"], "299536": ["\"It is a bold undertaking, to readjust what is expected of the MCU/Avengers formula, and there are moments when the sheer scale and momentum match the narrative ambition...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2018/4/25/avengers-infinity-war.html", "Amazing.  Visually stunning.  So much going on, but somehow also clear and easy to understand.  A little flabby in the middle third, but given the huge cast and story to cover it is very understandable.  The highlight was the parings of characters from different stories and their interactions.\r\n\r\nIf you aren't a Marvel fan this film won't convert you, but if you have liked any of the previous films you will like this too.\r\n\r\n10/10", "Just a very short, NO SPOILERS review I wanted to get down while it's still fresh.\r\n\r\nFor a movie with this much riding it, to come out not feeling disappointed, is a **massive** achievement. While I absolutely do love it I had some things that I felt were maybe imperfect about _Infinity War_, but my biggest concern was that it seemed like it would be absolutely meaningless to somebody who didn't put in the effort of watching the 18 movies leading up to it. You can probably assuage that fear though, because I went to see it with two people who had only seen _Black Panther_ at this point, and they both loved it, with minimal confusion.\r\n\r\nPersonally? I can't wait to see it again. This is probably the most excited I've been about the second watch of an MCU film since the first _Avengers_.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "The third act turns on a character being an idiot. That story beat renders all that the heroes do before and after it immaterial. That moment so preoccupied me that I couldn't enjoy the rest of the story, and made it impossible to ignore the flick's other glaring flaws anymore: the villain's motive makes no sense, the glove exists only to produce plot contrivances, the score is so obvious it might as well be cue cards on screen (\"Feel sad now\") ...\r\n\r\nThe first half is some of the best action in a Disney Marvel entry yet, and the other half is so stupid that it sours the whole MCU experience.", "Best MCU movie, more than that.... BEST SUPERHERO MOVIE EVER. Hands Down", "Nice Movie.", "Massive, epic movie. I'm so happy that Marvel is stepping up their game with their villains. For too long, MCU villains have been too bland and generic. But lately, the villains have improved with Michael Keaton's Vulture, Michael B. Jordan's Killmonger, and now James Brolin's Thanos. Thanos has appeared in several other MCU films, but he seemed rather flat in those movies. Here, he's allowed to be fully developed as a character. Especially touching is his relationship with his adoptive daughter, Gamora. It's actually surprisingly tender and moving. Thanos is the actual main focus of the film, and if he failed as a character, the entire movie wouldn't have worked. So bravo, Marvel!", "Best Movie Ever...", "***Moving ending, but the least of the Avengers movies IMHO***\r\n\r\nRELEASED IN 2018 and directed by Anthony & Joe Russo, \"Avengers: Infinity War\" chronicles events when the Avengers team-up with several allies to defeat the cosmic despot Thanos, whose goal is to collect all six Infinity Stones to attain unimaginable power and radically solve one of the Universe's most challenging problems.\r\n\r\nThe story focuses on Thanos, Thor and the Guardians of the Galaxy, especially Gamora, as well as Iron Man, Doctor Strange and Spider-Man. The rest of the cast members are more peripheral, e.g. Black Widow, Captain America, Black Panther, Vision and Scarlet Witch.\r\n\r\nThis is easily the least of the Avengers trilogy. Not to mention \"Captain America: Civil War\" (2016) and \"Thor: Ragnarok\" (2017) are significantly more compelling and all-around entertaining. Actually, all three Thor flicks are palpably superior, as is \"Iron Man 2\" (2010). If you haven't already, I encourage you to watch these movies prior to viewing \"Infinity War,\" as well as \"Black Panther\" (2018) and the two \"Guardians of the Galaxy\" flicks (2014/2017); otherwise you'll likely be lost because all these movies lead up to this one.\r\n\r\n\"Infinity War\" is certainly an ambitious comic book movie in that it notably juggles so many super-beings, but this lack of focus isn't conducive to suspense or great drama. It's merely decent with overkill CGI. The big battle in the closing act with the easily slaughtered four-armed dog-creatures is curiously dull; moreover, the attempts at humor sometimes feel forced and fall flat, but several jokes are laugh-out-loud funny, e.g. \"Rabbit.\" Thankfully, the film adds moving drama and gets extra points for a bold, poignant climax, which sets up the 2019 sequel \"Endgame.\"\r\n\r\nTHE MOVIE RUNS 2 hours, 29 minute and was shot in New York City, Scotland and Philippines with studio work done in Pinewood Atlanta Studios in Fayetteville, Georgia. WRITERS: Christopher Markus and Stephen McFeely.\r\n\r\nGRADE: B-", "I Love this movie.", "It's the epitome of superhero trash and the franchise of manchildren.  The ultimate smashing your toys together to battle only this time it's for the world to see.", "In 2012, Marvel Studios changed the cinematic landscape with a payoff that was five films in the making, proving a linked universe of movies could work.\r\nIn 2014, they proved to be one of the finest purveyors of entertainment by releasing two of the best genre films of all time back to back.\r\nIn 2018, Avengers: Infinity War is the culmination of ten years of narrative buildup. All the pieces were patiently put in place. The payoff? Never did my inner 8 year old think he would ever be watching a movie with Iron Man and Spider-Man sharing the same screen together, but here we are. Avengers: Infinity War is a very fine piece of 'turn your brain off' storytelling, except it actually goes the extra mile to have some intelligence.\r\n\r\nWe all know the film isn't the Endgame, but we're primed and ready for Part 2. Shut up and take my 💰 Marvel!", "One of the best Marvel Movies!"], "299534": ["The epic Marvel Saga that started over ten years ago has been building up to the inevitable clash with the powerful tyrant Thanos (Josh Brolin).  Last year’s “Avengers: Infinity War” set the stage for the highly-anticipated conclusion; “Avengers: End Game” and at long last it has arrived.\r\n\r\nPicking up shortly after the events of the last film, the Avengers must deal with the aftermath of what Thanos has done. The team is naturally divided between wanting revenge, wanting to set things right, and just wanting to take what they have and go on. \r\n\r\nAs time passes and they struggle to accept the reality of their situation; an unexpected individual returns and with them comes the seeds of a new plan to make things right. Naturally Tony Stark (Robert Downey Jr.) is skeptical but eventually warms to the possibilities of the idea thanks to a new scientific breakthrough that makes it possible.\r\n\r\nInspired, Tony sets out to put an elaborate plan in motion that will allow the team to try to fix things and to stop Thanos once and for all.\r\n\r\nWhat follows is an extended and at times nostalgic heist where various members of the team work to assemble the pieces needed for the plan as they believe they only have one chance to make things right.\r\n\r\nThe film is essentially three acts in one. The first deals with the recap and expansion of their situation and the planning. The second act is basically a heist where action and comedy are blended with some touching moments.\r\n\r\nThis all leads to the final act which is the FX laden set piece where the ensemble cast gathers to fight the forces of evil in a battle to save the Universe.\r\nThe film is epic in scale and length as it clocks in at over three hours but the movie is filled with so much content that the time goes by quickly and you have a hard time believing three hours have elapsed.\r\n\r\nIt is also a difficult film to review as you cannot recap elements of the film in any great detail without giving away elements that are sure to delight the fans. Suffice it to say that my only real issue with the fil and it was minor; was that it took a while to get to the action but at least there was plenty to keep you entertained along the way.\r\n\r\nAs this phase of the Marvel Film Universe winds down and plans are put in place for the next five years; “Avengers: End Game” is a satisfying conclusion to the epic saga that was started many years ago and weaves elements of many of the past Marvel films into an entertaining tale which features all of the best elements that have made the series of films such big hits.\r\n\r\n4.5 stars out of 5", "Hey, so, just some really quick thoughts I wanna get down, 'cause it's after 1 o'clock in the morning, and I wanna get some sleep so I can wake up well rested to see _Endgame_ again.\r\n\r\nPutting it out there right from the get-go, _Avengers: Endgame_ is my favourite MCU movie. It's my favourite movie of the year too, but I've only seen like ten or so 2019 releases, and this is the 22nd Marvel Cinematic Universe film, so that seems far and away the bigger deal. I can't say it's perfect, there's some conflicting stuff within its own runtime that really doesn't seem to gel (though a re-watch may prove me wrong on that), and it's not like every moment was the no-holds-barred-zero-exception best version of that moment from start to end. But God I loved this thing.\r\n\r\nI will say this though, the reason that I loved it, is this thing is fan service galore. If you do not care for the franchise's 21 movies preceding this point, then _Endgame_ is not the movie to turn you around on that. That may come in a future installment, but this one is a culmination. It's the end of _Infinity War_ but also Phase 3, but also a wrap-up and genuine ode to/send off for everything that Marvel has done over the past 11 years. That to me was incredible, and I am eternally greatful, but I cannot imagine it working for people who have no vested interest in these characters.\r\n\r\nTo me though? My first 9 out of 10 rating in **three years**.\r\n\r\n_Final rating:★★★★½ - Ridiculously strong appeal. I can’t stop thinking about it._", "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nDon't worry. This is going to be a pretty vague review. Right now, as I'm writing this sentence, I'm still processing what I saw and how am I going to explain how I felt without spoiling a single tiny thing. First of all, it's such a mix of feelings. On one hand, I'm extremely happy that I was lucky to be alive during this epic time and that I was able to follow these characters that I love and care about so much. On the other hand, I'm obviously sad that it finally reached the end of this (hopefully) first incredible saga. There are no perfect films and one with so many heroes will always have struggles balancing it all (Infinity War already had this issue). \r\n\r\nHowever, the Russo brothers did everything they could to deliver a phenomenal story, and they did. I don't think this could have been any better. Its last hour exceeds any expectations. It's epic, emotional, action-heavy, and it has one of my favorite shots in the entire history of cinema. It's pure magic, and the VFX team will surely get an Oscar for it. The action reminded me of the biggest Lord of the Rings' battles, and it was impeccably filmed, filled with riveting and chill-inducing sequences. Nevertheless, don't expect this high-intensity feeling throughout the whole runtime. The other two acts are a slow-burn build-up to a payoff that's going to make you pretty much either \"love\" or \"like\" this movie. I absolutely love it! \r\n\r\nThis is easily one of the best MCU films, if not my new number one. I can't deny that the 3-hour runtime has some unnecessary scenes, but even if they don't have a significant impact on the plot or even in the characters, they still contribute to the enormous build-up. Seeing this family that we grew up with just talking with each other or having lunch, at the same time that they deal with the consequences of Thanos' snap, is inexplicably captivating and heartwarming. Characters like Natasha (Scarlett Johansson) and Steve (Chris Evans) supporting each other is simply beautiful. Their comradery and chemistry are worthy of some tears here and there.\r\n\r\nSome people didn't really enjoy Infinity War so much due to the lack of screentime that some characters had. This time around, there are fewer characters to work with, so the balance is better. Everyone gets an important role, from Captain America to Ant-Man (Paul Rudd) to Nebula (Karen Gillan), and even Rocket (Bradley Cooper). Every single character has a major moment. If you take one out of the movie, it just doesn't work anymore. This is not only great work from the directors, but also from the writers. \r\n\r\nChristopher Markus and Stephen McFeely are not even going to be remembered because fans will always think of the cast first. Most of them will also remember the directors. But the writers?! If I stand at the door of the theater at the end of the film and question everyone about who are the writers, I strongly believe most of the audience won't know. Every dialogue, every sentence, every word carries so much impact on the narrative. Literally, I cried and got chills just by hearing two freaking words with the perfect timing in between. The amount of grief that the words of the ones who've lost everyone and everything carry is palpable and, for me, those are the most emotional moments of the movie: seeing how everyone is suffering from their own losses, not the deaths themselves.\r\n\r\nThe humor is mostly on-point, but it's still connected to my only real issue with the film, which is the second act's tone. From the moment the team decides what to do, we already know that this is a 1 in 14 million chance of success like Dr. Strange (Benedict Cumberbatch) said, so the stakes and pressure are massive! With this level of tension, I didn't expect such an “easygoing” and “funny” vibe throughout, except for one particular sequence. They do a great job once again of pairing up certain Avengers together, but most of them go through these too comedic plot points for such a crucial and serious mission. Fortunately, this act carries enough action and emotional drive to make this problem not that big of an issue.\r\n\r\nVisually, this is arguably the best-looking superhero film ever. From the mind-blowing visual effects to the gorgeous cinematography, everything is perfect. The costumes are gritty and muddy when our heroes are in a battle, their faces are all filled with blood, and I have no words to describe how jaw-dropping that last act is. I can't wait to change my desktop wallpaper once THAT shot is available. I dropped a single tear just by looking at it. No one talks, no one does anything. It's just an amazingly beautiful image. The score is epic as hell. So much that I'm listening to it right now as I'm writing this review, and I'm getting chills all over my body. \r\n\r\nI can't really write much more, to be honest. I will acknowledge the cast because they are brilliant. Each and every single member delivers an outstanding performance, but if I had to choose the ones that both surprised me and had the most impact on me, they would be Johansson's, Evans', and Robert Downey Jr's (Tony Stark / Iron Man). “New” characters like Captain Marvel (Brie Larson) blend seamlessly, and the payoff is unbelievably satisfying. In terms of predictability, it goes more or less as I expected, but it still carries a few surprises throughout. Nothing is ever like we imagine or theorize about, so expect the unexpected, and don't judge a movie by if it fits your crazy, unrealistic theories that never crossed the producers and directors' minds in the first place!\r\n\r\nAll in all, I don't know what to do now. The only thing I'm sure of is that I want to see it again, as soon as possible. The last hour is f*cking insane. I couldn't fall asleep properly because I couldn't stop thinking about it. Endgame surpasses all expectations. It's everything I wished for and so much more. I could easily spend a whole day at the movie theater and watch three sessions in a row. It's that good. One of the best comic-book films of all-time, without a single doubt. Thank you to Kevin Feige and everyone who worked hard to bring the MCU to where it stands now. I can't even think of how are they going to produce something at the level of Infinity Saga. Maybe they never will. Maybe we'll have to wait another decade or two for something like this. Until then, see you at the next Endgame screening! Enjoy! Oh and #DontSpoilTheEndgame!\r\n\r\nPS: it's not a perfect movie, I know. It doesn't exist one. Yes, Endgame has some issues regarding its pacing and tone, but I would be lying to myself if this isn't everything I dreamed of. I felt the same way with Civil War, regarding the rating to give, and I ended up giving it an A after a first viewing. As soon as I watched the second time, I changed it to an A+. I don’t need to wait for that second viewing with Endgame … And thank you to my audience for being incredibly respectful. No yelling, no crazy laughs, no stupid people doing stupid stuff. Thank you so much for not ruining one of the best cinematic experiences of my life!\r\n\r\nRating: A+", "okay so if your like me you questioned this movie due to the fact that i personally thought nothing could beat infinity war well after seeing it i can honestly say we have a new champion this was absolutley excelent so hilarious action packed the 3 hrs passes extremily fast my only thing is the use of god.... bothered me and i suggest if your offended by that wait till dvd so you can mute the parts also a reminder to parents 'no matter how bad you want to see the movie dont do like people in my theater did and bring your 3 year old 'but besides that awesome movie", "We waited till day 5 of release in theaters. There was a slow start to the movie so i don't recommend taking little ones under the age of 10. After all the anticipation and hype,Avengers Endgame did not disappoint. Waa a perfect \"ending' to the series. Very well done", "These kind of movies are among the few movies that I can be bothered to go to an actual theater to watch nowadays. For most movies I just wait until they come out on disk (preferably Ultra HD Blu-ray if it’s available) and watch them on my home theater rig. So this weekend me and the kids went to the theater to watch Avengers: Endgame.\r\n\r\nI have to say that it was better, even much better, than I feared. I really feared that the SJW retards at Marvel would take this opportunity to completely re-organize the Marvel universe to their liking. Like how they completely ruined both professor Xavier and Wolverine in that abysmal Logan movie. Luckily, this did not really happen. Maybe the financial reality of their failing SJW comics and Disney doing a bit of culling of the most extreme of the Marvel retards, the ones who fail to understand that super hero movies are meant to entertain and not be their personal agenda channel, are starting to take effect.\r\n\r\nIt was actually a quite good movie with plenty of action, some humor and, of course, lots and lots of special effects. Even the story made somewhat sense, at least in the context of a Marvel movie, even though the writers resorted to time travel.\r\n\r\nThe movie starts of somewhat dark and grim but I guess that was to be suspected. It cheered up as it moved along and then ending … well to me at least it was mostly satisfactory.\r\n\r\nI was not too thrilled about the “new” Hulk although I warmed up to him a bit during the film. Thor? The less that is said about him the better actually. The rest of the merry bunch was in pretty good shape and I am quite happy that we did not get to see to much of Quill’s usual shenanigans. I really hate that character.\r\n\r\nI was quite positively surprised at the huge and quite cool battle towards the end. I was thinking, or rather hoping,  that at some time they were just going to reverse Thanos’ crap and that would be it but instead we get to watch another huge confrontation with pretty much everyone involved at the end. Very cool action and FX indeed.\r\n\r\nThere were some silly plot holes of course. As always when writers resort to time travel. An obvious one would of course be that, when they knew they only had enough Pym particles to complete one trip for each person why did they just not go back in time to get more the first thing they did? Especially since they later did exactly that. Also, Captain Marvel (in her new SJW hairdo) flies through a barrage of fire, smashes through Thanos’ ship like it was nothing and then struggles to combat Thanos himself? There were a bit of this silliness spread around but not too much for me to be bothered by it.\r\n\r\nThere were a few casualties of which I am saddened by two of them. I think at least one of them was unnecessary and probably agenda based. I also strongly disliked the rubbish with Captain America at the end. He has never been one of my favorite characters so I do not really care much about him being around or not but that rubbish sob-scene where he hands over his shield to a “politically correct” person was really unnecessary. I guess it must have been put there to appease the Marvel SJW retards.\r\n\r\nAnyway, my bottom line is that I was greatly entertained by this movie. It had all the good stuff, real super heroes, action, special effects and not too much of the crap that has been spewing out of Marvel the last years.", "Awesome!", "***How can they possibly save half of all living beings in the Universe?***\r\n\r\nHow are the surviving Avengers & Co. possibly going to save half of the Universe that died? My wife & I had this discussion before viewing. It basically comes down to two options (assuming the events in \"Infinity War\" weren’t just a dream): magic or time travel. All I’ll say is: What they came up with was in ways reminiscent of the plot convolutions of \"Back to the Future II\" (1989).\r\n\r\n“Endgame” (2019) begins strong with the devastating reality of half of all living beings in the Universe suddenly vanishing. It starts to get lethargic about an hour in, but perks up with the three teams trying to apprehend the Infinity Stones so they can maybe reverse what happened at the end of the previous film.\r\n\r\nEverything naturally leads to a huge battle in the last hour that I found boring, not to mention that the epilogue tended to drag on with too much of it being tedious. Still, there are lots of worthy bits throughout, like the opening, the unpredictable first encounter with Thanos, Thor getting flabby, the moving match between Black Widow and Hawkeye at the cliff’s edge, and much more. \r\n\r\nUnfortunately, the myriad protagonists work against the film because it can’t concentrate on any one or two characters for very long. Captain Marvel is short shifted and decidedly dull. Plus the movie’s overlong at 3 hours, 1 minute.\r\n\r\nGRADE: B/B-", "The amazing fight scenes and CGI aren’t enough to mask the fact that the overall plot of going back in time to change reality is just plain stupid and lazy - and this is addressed to the writers. I did know that there was gonna be some time travel involved, but the way Marvel explained and executed it didn't too well for me. They can't get away with just putting it all in \"Quantum.”", "Sure the final fight with Thanos is more than epic, but I expected more than that. I wanted substance and a plot that didn't rely on \"quantum\" for all the questions and explanations.", "Sadly, I didn't enjoy this one as much as I did with the first \"Avengers\" movies.", "Honestly, it felt like it was too much of a set-up for me. Having Antman isolated in the Quantum realm was just too convenient and it felt like Marvel was just looking for a foundation for the script they had for this movie that wasn't even as good as the previous ones.", "Needed more Dr. Strange action! Felt like the final fight scene with Thanos could've been choreographed a lot better especially when you have a magic caster who could dish out different spells like Dr. Strange. But alas, he was instead given the duty of holding off the impending doom from crashing down on his team.", "Not a big fan of the ending. But I guess when you have only 0.000000000001% chance of winning you can't expect it to be the best ending there is.", "First of all, good popcorn movie, if you are hardcore fan of marvel or visual effect in general, this is a movie for you. \r\n\r\nHowever, it is clear that imagination of Marvel studio keeps deteriorating. The process and ending is clear about 10% into the movie. Zero development of character. Amateur plot twist. All cliche and low class humor. It is 21st century and they still cling on adult fairy tale and plain visual stimulation. The whole purpose is to let fans know what happens to the character. Good business investment but great shame to the art of movie industry. It is a blatant exploitation of grandpa IP with zero innovation. \r\n\r\nHero fantasy lived in half a century ago. Time to learn from modern Japanese manga and anime (I am not talking about One Piece or Naruto). Stop stitching up individuals from different background and call it a universe, it's laughable at best.", "The amazing fight scenes and CGI aren’t enough to mask the fact that the overall plot of going back in time to change reality is just plain stupid and lazy - and this is addressed to the writers. I did know that there was gonna be some time travel involved, but the way Marvel explained and executed it didn't too well for me. They can't get away with just putting it all in \"Quantum.”", "Great ending but I still can't get over the fact that the writers had to kill my all-time favorite Avenger, Iron Man. Still, it was a sacrifice that must be taken for the greater good. I love the movie!", "I kind of expected Tony Stark to be the one to take the fall but what caught me off guard was Cap's decision to return to his original timeline. Man, I can take losing one main Avenger but two? It was just heartbreaking.", "That final fight with Thanos was epic! Great idea by the writers to have everybody be teleported back when Cap needed them the most. Officially the greatest superhero movie of all time!", "With all the hype surrounding this film before its release, it was hard not to have high expectations once it finally went out.I myself am one of those people. Fortunately, it did pretty well and didn't disappoint. To me, it would've been better if all their time traveling somehow created ripple effects in the present to make it more realistic but I guess you can only fit so much content in a film."]}